Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: These constants are used by all methods that search for, or replace values, using a regular expression.
ja: これらの定数は、正規表現を使って値を捜す、または置換する、全てのメソッドによって使われます。

source: These constants are used by the NSIntegral Rect With Options(_: _:) function and other related methods, such as backing Aligned Rect(_: options:).
ja: これらの定数は、NSIntegral Rect With Options(_: _:)関数および他の関連メソッドによって使われます、例えばbacking Aligned Rect(_: options:)など。

source: These constants are used by the urls(for: in:) and url(for: in: appropriate For: create:) File Manager methods.
ja: これらの定数は、urls(for: in:)とurl(for: in: appropriate For: create:) File Managerメソッドによって使用されます。

source: These constants are used by the property options, regular Expression With Pattern: options: error:, and init(pattern: options:).
ja: これらの定数は、プロパティoptions、regular Expression With Pattern: options: error:、そしてinit(pattern: options:)によって使われます。

source: These constants are used to indicate how items in a request are ordered, from the first one given in a method invocation or function call to the last (that is, left to right in code).
ja: これらの定数は、メソッド発動や関数呼び出しにおいて与えられる最初のものから最後のものへ（すなわち、コードの中で左から右へ）、ある依頼の中の項目いくらかがどうやって並べられるか、を指し示すために使われます。

source: These constants define the regular expression options.
ja: これらの定数は、正規表現オプションを定義します。

source: These constants define the supported keys in a cookie attributes dictionary.
ja: これらの定数は、クッキー属性辞書でサポートされるキーを定義します。

source: These constants specify rounding behaviors.
ja: これらの定数は、丸め挙動を指定します。

source: These constants specify the behavior of notifications posted using the post Notification Name(_: object: user Info: options:) method.
ja: これらの定数は、post Notification Name(_: object: user Info: options:)メソッドを使って投函される通知の挙動を指定します。

source: These constants specify the caching strategy used by an NSCached URLResponse object.
ja: これらの定数は、NSCached URLResponseオブジェクトによって使われるキャッシュ戦略を指定します。

source: These constants specify the location of a variety of directories by the urls(for: in:) and url(for: in: appropriate For: create:) File Manager methods.
ja: これらの定数は、いろいろなディレクトリの位置をurls(for: in:)とurl(for: in: appropriate For: create:) File Managerメソッドによって指定します。

source: These constants specify the type of checking the methods should do.
ja: これらの定数はチェックする型、それらメソッドがすべきこと、を指定します。

source: These constants specify the types of notification delivery suspension behaviors.
ja: これらの定数は、通知配達待機挙動の型を指定します。

source: These counters can be used as indices only in instances of zero-based, integer-indexed collections, such as Array and Contiguous Array.
ja: これらのカウンタはインデックスとして使われることが、ゼロ基盤の、整数インデックスでのコレクション、例えばArrayそしてContiguous Arrayなどのインスタンスにおいてのみ可能です。

source: These flag values may be specified within the pattern using the (?ismx-ismx) pattern options.
ja: これらのフラグ値は、パターンの範囲内で(?ismx-ismx)パターン・オプションを使って指定されことができます。

source: These methods allow scriptable objects to provide a fully specified object specifier to themselves within an app.
ja: これらのメソッドは、さまざまなスクリプト対応オブジェクトに、あるアプリ内部でそれら自身への完全に指定されたオデジェクト指定子を提供できるようにします。

source: These methods must operate on the backing store that you provide for the elements of the collection.
ja: これらのメソッドは、あなたがコレクションの要素に対して提供するバッキングストア上で演算を行わなければなりません。

source: These methods use available network administration services to discover all names and addresses for the host requested.
ja: これらのメソッドは、利用可能なネットワーク管理サービスを使って、要請されたホストに対する全ての名前とアドレスを発見します。

source: These pathnames are relative to the directory.
ja: これらのパス名は、そのディレクトリに相対的です。

source: These strings are the possible values for the type attribute key contained in the dictionary object returned by attributes Of Item(at Path:).
ja: これらの文字列は、attributes Of Item(at Path:)によって返される辞書オブジェクトの中に含まれるtype属性キーに対する可能な値です。

source: These tasks often require data to be encoded and decoded to and from an intermediate format while the data is being transferred.
ja: これらの作業がしばしばデータに要求するのは、データが転送される間に中間形式へとおよびそれからエンコードおよびデコードされることです。

source: These types include standard library types like String, Int, and Double; and Foundation types like Date, Data, and URL.
ja: それらの型は、String、Int、そしてDoubleのような標準ライブラリ；そしてDate、Data、そしてURLのようなFoundation型を含みます。

source: They also enable containers of objects to perform their own specifier evaluation.
ja: それらはまた、オブジェクトのコンテナにそれ自身の指定子評価を実行できるようにします。

source: They are returned by result Type.
ja: それらはresult Typeによって返されます。

source: They are set to post when the run loop of the thread that started the asynchronous operation is idle.
ja: それらは、非同期演算を開始したスレッドの実行ループがアイドル状態である時に投函するよう設定されます。

source: They are typically used to localize standard file and directory names according to the user’s language settings.
ja: それらは、概して標準的なファイルおよびディレクトリ名をユーザの言語設定にかなうようローカライズするために使われます。

source: They don’t attempt to contact the host itself, however.
ja: それらは、しかしながら、ホストそれ自体に接触を試みません。

source: They may also reflect other modifications, such as the removal of filename extensions.
ja: それらはまた他の修正も反映するかもしれません、例えばファイル名拡張子の除去など。

source: They provide information about the calendar and support for calendrical computations such as determining the range of a given calendrical unit and adding units to a given absolute time.
ja: それらは、カレンダーについての情報を提供して、カレンダーに関する計算、例えば与えられたカレンダー的単位の特定や与えられた絶対時間への単位の追加などをサポートします。

source: The contents Value and properties are derived from the with contents and with properties parameters of the make command.
ja: contents Valueとpropertiesは、makeコマンドのwith contentsとwith propertiesパラメータから引き出されます。

source: The Objective-C module APIs define the base of the Objective-C language. These APIs include:
ja: Objective-CモジュールAPIは、Objective-C言語の基礎を定義します。それらAPIは以下のものを含みます：

source: This NSData object is also suitable for passing to init(serialized Representation:).
ja: このNSDataオブジェクトはまた、init(serialized Representation:)を渡すために適しています。

source: This URL is used to determine if the cookie should be accepted if the cookie accept policy is NSHTTPCookie Accept Policy Only From Main Document Domain.
ja: クッキー受入方針がNSHTTPCookie Accept Policy Only From Main Document Domainならば、このURLはクッキーが受け入れられるべきかを決定するために使われます。

source: This URL must be constructed from a URL returned by the url(for Ubiquity Container Identifier:) method, which you use to retrieve the desired iCloud container directory.
ja: あなたが要望するiCloudコンテナディレクトリを捜してくるために使うurl(for Ubiquity Container Identifier:)メソッドによって返されるURLから、このURLは組み立てられなければなりません。

source: This allows 0.5 to be treated in a visually consistent way.
ja: これは、0.5が視覚的に首尾一貫した方法で扱われるようにします。

source: This allows the comparison to be based on some outside parameter, such as whether character sorting is case-sensitive or case-insensitive.
ja: これは、比較がいくつかの外部パラメータに基づくことを可能にします、例えば文字列ソートが大文字小文字を区別したり区別しなかったりなど。

source: This approach avoids untimely delays due to a host being unavailable, but it may result in incomplete information about the host.
ja: この取り組み方は、時期悪くホストが利用可能でないことが原因の遅滞を防ぎます、しかしそれはホストについての不完全な情報という結果になるかもしれません。

source: This array must contain at least one string.
ja: この配列は、少なくとも１つの文字列を含まなければなりません。

source: This behavior drops all units whose values are 0.
ja: この挙動は、値が０である全ての単位を落とします。

source: This behavior may trigger additional delegate notifications related to copying and removing individual items.
ja: この挙動は、別個の項目のコピーと削除に関係した追加の委任先通知の引き金となるかもしれません。

source: This behavior pads values with zeroes as appropriate.
ja: この挙動は、適切にゼロで値を詰めものします。

source: This by-reference parameter is populated with the top level objects of the nib.
ja: この参照によるパラメータは、nibのトップレベルのオブジェクトそれらに入れられます。

source: This calendar does not track changes that the user makes to their preferences.
ja: このカレンダーは、ユーザがそれらの環境設定にする変更を追跡しません。

source: This call may block if I/O is required to determine values for the requested property Keys.
ja: これはブロックを呼び出すかもしれません、もしI/Oが要請されたproperty Keysに対する値を決定する必要があるならば。

source: This can be mitigated by changing the file protection to complete when the device is unlocked.
ja: これは、デバイスがアンロックされる時に、ファイル保護をcompleteに変更することによって緩和できます。

source: This capability provides the basis for archiving (where objects and data items are stored on disk) and distribution (where objects and data items are copied between different processes or threads).
ja: この能力は、アーカイブ（そこにおいてオブジェクトやデータ等の項目がディスク上に保管されます）と分散（そこにおいてオブジェクトやデータ等の項目が異なるプロセスまたはスレッド間でコピーされます）の基礎を提供します。

source: This class has several designated initializers.
ja: このクラスは、いくつかの指定イニシャライザを持ちます。

source: This class is a wrapper for the underlying Apple event descriptor data type, AEDesc.
ja: このクラスは、基盤となるアップルイベント記述子データ型、AEDescに対するラッパーです。

source: This class provides applications with the ability to
ja: このクラスは、アプリケーションに以下の能力を提供します

source: This class supports two different cookie versions:
ja: このクラスは、２つの異なるクッキーバージョンをサポートします：

source: This code example gets several attributes of a file and logs them.
ja: このコード例は、あるファイルの幾つかの属性を取得して、それらを記録します。

source: This code fragment enumerates the subdirectories and files under a user’s Documents directory and processes all files with an extension of .doc:
ja: このコード断片は、ユーザのDocumentsディレクトリの下の下位ディレクトリとファイルを列挙します、そして.docの拡張子を持つすべてのファイルを処理します：

source: This code fragment gets the contents of /System/Library/Fonts after verifying that the directory exists:
ja: このコード断片は、/System/Library/Fontsの内容を、そのディレクトリが存在することを検証した後に取得します：

source: This command corresponds to AppleScript’s duplicate command.
ja: この命令は、AppleScriptのもつduplicateコマンドに相当します。

source: This command corresponds to AppleScript’s make command.
ja: この命令は、AppleScriptのもつmakeコマンドに相当します。

source: This constant has no effect if the search range contains the entire string.
ja: 検索範囲が文字列全体を含むならば、この定数には効果がありません。

source: This constant specifies the notification center type.
ja: この定数は、通知センター型を指定します。

source: This container can be unique to the app or shared by multiple apps.
ja: このコンテナは、そのアプリに特有であるまたは複数のアプリで共有されることが可能です。

source: This cookie attribute is only used for Version 0 cookies.
ja: このクッキー属性は、ただVersion 0クッキーに対してのみ使われるだけです。

source: This cookie attribute is optional.
ja: このクッキー属性は任意です。

source: This cookie attribute is required.
ja: このクッキー属性は、必須です。

source: This date appears first in the resulting string.
ja: この日付は結果文字列において最初に現れます。

source: This date appears last after the hyphen in the resulting string.
ja: この日付は結果文字列においてハイフンの後で最後に現れます。

source: This descriptor represents an open file or socket that you created previously.
ja: この記述子は、あなたが以前に作成した、開いたファイルまたはソケットを表します。

source: This descriptor, including any mutations, will be returned to the sender of the current event when all handling of the event has been completed, if the sender has requested a reply.
ja: あらゆる変異体を含めて、この記述子は、全てのイベント取り扱いが完了したところで現在のイベントの送り手に返されます、送り手が返答を要求するならば。

source: This descriptor, including any mutations, will be returned to the sender of the suspended event when handling of the event is resumed, if the sender has requested a reply.
ja: あらゆる変異体を含めて、この記述子は、そのイベントの取り扱いが休止された時に休止イベントの送り手に返されます、送り手が返答を要求するならば。

source: This dictionary can be used with init(properties:) or cookie With Properties: to create an equivalent NSHTTPCookie object.
ja: この辞書は、init(properties:)またはcookie With Properties:で使われることで、NSHTTPCookieオブジェクト相当物を作成できます。

source: This document defines constants in the Foundation framework that are not associated with a particular class.
ja: この文書は、Foundationフレームワークの定数を定義します、それは特定のクラスと結び付けられません。

source: This document describes the data types and constants found in the Foundation framework.
ja: この文書は、Foundationフレームワークにおいて見つけられるデータ型と定数を記述します。

source: This error is returned if the executable is not recognized as a loadable executable.
ja: 実行可能ファイルがロード可能な実行ファイルとして認められないならば、このエラーが返されます。

source: This error might occur if the bundle depends on a framework or library that is missing or if the required framework or library is not compatible with the current architecture or runtime version.
ja: 行方不明のフレームワークやライブラリにそのバンドルが依存するならば、または必須フレームワークやライブラリが現在のアーキテクチャやランタイムのバージョンと互換性がないならば、このエラーが起こるかもしれません。

source: This example checks to see whether a favorite actor is in an array storing a movie’s cast.
ja: この例は、お気に入りの俳優が映画出演者を格納する配列の中にいるかどうか見るために調べます。

source: This example creates a Closed Range<Character> from “a” up to, and including, “z”.
ja: この例は、「a」から「z」までの、そしてそれを含むClosed Range<Character>を作成します。

source: This example creates a Partial Range From<Double> instance that includes any value greater than or equal to 5 .0.
ja: この例は、Partial Range From<Double>インスタンスで5 .0より大きいか等しい何らかの値を含むものを作成します。

source: This example creates a Partial Range Through<Double> instance that includes any value less than or equal to 5 .0.
ja: この例は、Partial Range Through<Double>インスタンスで5 .0より少ないか等しい何らかの値を含むものを作成します。

source: This example creates a Partial Range Up To<Double> instance that includes any value less than 5 .0.
ja: この例は、Partial Range Up To<Double>インスタンスで5 .0より少ない何らかの値を含むものを作成します。

source: This example creates a Range<Double> from zero up to, but not including, 5.0.
ja: この例は、ゼロから5.0までの、しかしそれを含めないRange<Double>を作成します。

source: This example demonstrates getting a slice of an array of strings, finding the index of one of the strings in the slice, and then using that index in the original array.
ja: この例は文字列からなる配列のあるスライスの取得を実演します、スライスの中の文字列の１つのインデックスを見つけて、それからそのインデックスを元の配列において使います。

source: This example enumerates the characters of the string “Swift” and prints each character along with its place in the string.
ja: この例は文字列「Swift」の文字を列挙します、そして各文字をその文字列でのそれの場所とともに出力します。

source: This example finds the largest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も大きな値を見つけます。

source: This example finds the smallest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も小さい値を見つけます。

source: This example gets an array that identifies the fonts in the user's fonts directory:
ja: この例は、ユーザのフォントディレクトリのフォントを識別する配列を取得します：

source: This example iterates over the indices and elements of a set, building a list consisting of indices of names with five or fewer letters.
ja: この例は、ある集合のインデックスと要素のすべてにわたって反復します、５つまたはより少ない文字を持つ名前のインデックスから成るリストを作ります。

source: This example prints the characters of a string in reverse order:
ja: この例は、ある文字列に属する文字を逆順で出力します。

source: This example removes the middle element from an array of measurements.
ja: この例は、測定結果からなる配列から真ん中の要素を除去します。

source: This example removes two elements from the middle of an array of measurements.
ja: この例は、測定結果からなる配列の真ん中から２つの要素を除去します。

source: This example searches streets Slice for one of the strings in the slice, and then uses that index in the original array.
ja: この例は、streets Sliceをスライスの中の文字列の１つについて検索して、それからそのインデックスを元々の配列において使います。。

source: This example shows how an array of [Int] instances can be joined, using another [Int] instance as the separator:
ja: この例は、どのようにいくつかのの[Int]インスタンスからなる配列が別の[Int]インスタンスをセパレータとしてつなぎ合わされるかを示します。

source: This example shows how to build a dictionary of letter frequencies of a string.
ja: この例は、ある文字列の文字頻度の辞書を作り上げる方法を示します。

source: This example shows how to find the sum of an array of numbers.
ja: この例は、どのように数からなる配列の合計を見出すかを示します。

source: This example shows how to use the max(by:) method on a dictionary to find the key-value pair with the highest value.
ja: この例は、max(by:)メソッドを辞書上で使って、最も高い値を持つキー値ペアを見つける方法を示します。

source: This example shows how to use the min(by:) method on a dictionary to find the key-value pair with the lowest value.
ja: この例は、min(by:)メソッドを辞書上で使って、最も低い値を持つキー値ペアを見つける方法を示します。

source: This example shows how you can check an array for an expense greater than $100.
ja: この例は、どのようにあなたが$100より大きい出費についてある配列を調べることができるかを示します。

source: This example shows how you can modify one of the names in an array of students.
ja: この例が示すのは、どうやってあなたが学生らの配列の中の名前の１つを修正できるかです。

source: This example tests whether one countable range begins with the elements of another countable range.
ja: この例は、ある可付番範囲が別の可付番範囲の要素で始まるかどうかテストします。

source: This example tests whether one countable range shares the same elements as another countable range and an array.
ja: この例は、ある可付番範囲が同じ要素を別の可付番範囲とそしてある配列と共有するかどうかをテストします。

source: This example uses the contains(_:) method to check whether next-day shipping is in the available Options instance.
ja: この例は、contains(_:)メソッドを使って翌日出荷がavailable Optionsインスタンスの中のあるかどうか確認します。

source: This example uses the intersection(_:) method to limit the available shipping options to what can be used with a PO Box destination.
ja: この例は、intersection(_:)メソッドを使って、利用可能な出荷オプションを私書箱宛先で使われるものに制限します。

source: This example uses the lexicographically Precedes method to test which array of integers comes first in a lexicographical ordering.
ja: この例はlexicographically Precedesメソッドを使って、どの整数配列がある語彙筆記的順序において最初に来るかをテストします。

source: This example uses the union(_:) method to add two more shipping options to the default set.
ja: この例は、union(_:)メソッドを使って２つのさらなる出荷オプションを省略時のセットに加えます。

source: This format makes addition and subtraction very convenient.
ja: このフォーマットは、加算と減算を大変便利にします。

source: This function assumes that you are mutating the contents.
ja: この関数は、あなたが内容を変化させていると仮定します。

source: This function deallocates memory that was allocated with NSAllocate Memory Pages.
ja: この関数は、NSAllocate Memory Pagesでアロケートされたメモリをデアロケートします。

source: This function does not actually swap the bytes of x.
ja: この関数は、xのバイトを実際にはスワップしません。

source: This function is deprecated and unavailable for use with ARC.
ja: この関数は、非推奨にされます、そしてARCで使うことはできません。

source: This function is useful for preserving the capacity of table.
ja: この関数は、tableの収容能力を保全するのに役立ちます。

source: This function returns NULL if it’s unable to allocate the requested memory.
ja: この関数は、それが要求されたメモリをアロケートできないならばNULLを返します。

source: This function should be called only when table keys are objects, not when they’re any other type of pointer.
ja: この関数は、tableのキーがオブジェクトである場合にのみ呼ばれるべきです、それらが何らかの他の型のポインタである時ではなく。

source: This function should be called only when table values are objects, not when they’re any other type of pointer.
ja: この関数は、tableの値がオブジェクトである場合にのみ呼ばれるべきです、それらが何らかの他の型のポインタである時ではなく。

source: This function should be called only when the table elements are objects, not when they’re any other data type.
ja: この関数は、テーブル要素それらがオブジェクトである場合にのみ呼び出されるべきです、それらが何か他のデータ型である場合ではなく。

source: This function should be called when you have finished using the enumeration struct enumerator.
ja: この関数は、あなたが列挙struct enumeratorを使って終了した場合に呼ばれるべきです。

source: This implementation of the encode(to:) method reverses the decoding operation from the previous example.
ja: encode(to:)メソッドのこの実装は、デコーディング演算を前の例から入れ替えます。

source: This informal protocol defines a set of methods that can be implemented to perform a comparison appropriate for scripting that is independent of other methods for doing comparisons.
ja: この非形式プロトコルは一揃いのメソッドを定義します、それはスクリプティングに妥当な比較を実行するよう実装されるもので、比較を行う他のメソッドから独立したものです。

source: This initializer creates an option set with a raw value of zero.
ja: このイニシャライザは、０個の生の値を持つオプションセットを作成します。

source: This initializer doesn’t necessarily allocate the requested memory right away.
ja: このイニシャライザは、必ずしも直ちに要求されたメモリをアロケートされません。

source: This input should exactly match one of the strings in the app's com .apple .security .application-groups entitlements array.
ja: この入力は、アプリの持つcom .apple .security .application-groups資格配列の中の文字列の１つに正確に合致すべきです。

source: This instance will be copied by struct Data.
ja: このインスタンスは、struct Dataによってコピーされます。

source: This is a convenience method for classes that adopt the NSCopying protocol.
ja: これは、NSCopyingプロトコルを採用するクラスのための簡易メソッドです。

source: This is a convenience method for classes that adopt the NSMutable Copying protocol.
ja: これは、NSMutable Copyingプロトコルを採用するクラスのための簡易メソッドです。

source: This is a convenience method that calls enumerate Matches(in: options: range: using:) passing the appropriate string, options, and range.
ja: これは、適切な文字列、オプション、そして範囲を渡して、enumerate Matches(in: options: range: using:)を呼ぶ、便宜メソッドです。

source: This is a convenience method that calls enumerate Matches(in: options: range: using:).
ja: これは、enumerate Matches(in: options: range: using:)を呼ぶ、便宜メソッドです。

source: This is a convenience method.
ja: これは便宜メソッドです。

source: This is an advanced method that is used only if you wanted to iterate through a list of matches yourself and do the template replacement for each one, plus maybe some other calculation that you want to do in code, then you would use this at each step.
ja: これは上級のメソッドです、それは、あなたがあなた独自のマッチ・リストに繰り返して、それぞれのものにテンプレート置換を、加えてもしかしたらあなたがコードにおいて実行したい何らかの他の計算を、実行することを望む場合にのみ使用されるものです、その時あなたはこれを各段階で使うでしょう。

source: This is based on astronomical calculation, instead of tabular behavior.
ja: これは天文計算に基づきます、表で算出するのではなく。

source: This is problematic because you cannot be sure what portion of the string was parsed.
ja: これは問題があります、なぜならあなたは文字列のどの部分が構文解析されたか確信できないからです。

source: This is the appropriate path for modern application and framework bundles.
ja: これは、モダンアプリケーションおよびフレームワークのバンドルに対する適切なパスです。

source: This is the default cookie accept policy.
ja: これは、省略時のクッキー受入方針です。

source: This is the default implementation of the greater-than operator (>) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対してのより大きい演算子（>）の初期状態の実装です。

source: This is the default implementation of the greater-than-or-equal-to operator (>=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きいか等しい演算子（>=）の初期状態の実装です。

source: This is the default implementation of the less-than-or-equal-to operator (<=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対しての、より少ないか等しい演算子（<=）の初期状態の実装です。

source: This is the default implementation of the not-equal-to operator (!=) for any type that conforms to Equatable.
ja: これは不等演算子（!=）の、Equatableに準拠するあらゆる型に対する初期状態の実装です。

source: This is the default value if use Default.
ja: use Defaultならば、これが省略時の値です。

source: This is the default value.
ja: これは省略時の値です。

source: This is the designated initializer for this class.
ja: これはこのクラスに対する指定イニシャライザです。

source: This is the designated initializer.
ja: これは、指定イニシャライザです。

source: This is the name displayed in the Finder sidebar, as well as in the Sharing preference panel.
ja: これは、Finderサイドバーで、それだけでなく「共有」環境設定パネルで表示される名前です。

source: This is the preferred method for posting notifications.
ja: これは、通知の投函に対する推奨メソッドです。

source: This is the same as NSAlign Min XInward|NSAlign Max XInward|NSAlign Min YInward|NSAlign Max YInward.
ja: これは、NSAlign Min XInward|NSAlign Max XInward|NSAlign Min YInward|NSAlign Max YInwardと同じです。

source: This is the same as NSAlign Min XNearest|NSAlign Max XNearest|NSAlign Min YNearest|NSAlign Max YNearest.
ja: これは、NSAlign Min XNearest|NSAlign Max XNearest|NSAlign Min YNearest|NSAlign Max YNearestと同じです。

source: This is the same as NSAlign Min XOutward|NSAlign Max XOutward|NSAlign Min YOutward|NSAlign Max YOutward.
ja: これは、NSAlign Min XOutward|NSAlign Max XOutward|NSAlign Min YOutward|NSAlign Max YOutwardと同じです。

source: This is the “one-past-the-end” position, and will always be equal to the count.
ja: これは「終わりを１つすぎた」位置です、そして常にcountと等しいです。

source: This is therefore equal to the size of the file.
ja: これは、従ってファイルの大きさと等しいです。

source: This is typically represented as "HTTP/1.1".
ja: これは概して "HTTP/1.1" のように表されます。

source: This is used to specify the start date for the Gregorian calendar switch from the Julian calendar.
ja: これは、ユリウス暦から切り替えるグレゴリオ暦に対する開始日を指定するために使われます。

source: This is useful if you want to make sure your application doesn't hold files open (mapped files are open files), therefore preventing the user from ejecting DVDs, unmounting disk partitions, or unmounting disk images.
ja: ファイルを開いたまま保持することを（マップされたファイルは開いたファイルです）、したがってユーザがDVDを取り出す、ディスクパーティションをアンマウントする、またはディスクイメージをアンマウントするのを妨害することを、あなたのアプリケーションが行わないのを確実にしたいとあなたが望むならば、これは役に立ちます。

source: This is useful when you simply want to redirect messages to another object and can be an order of magnitude faster than regular forwarding.
ja: これは、あなたがメッセージを別のオブジェクトに単純に転送したい場合に実用的で、正規に転送していくよりも膨大な規模の速さを持つことがあります。

source: This may be nil.
ja: これはnilであるかもしれません。
